["aslr", "jwt", "aws", "idor", "ddos", "overflow", "md5", "aes", "pkcs", "json","dtd", "dns", "ecc", "ftp", "sftp", "ssh",
"udp", "tcp", "firewall", "fde", "dep", "dep", "hmac", "xhtml", "xmp", "icmp", "imap", "pop3", "auth", "ipsec", "kerberos",
"ldap", "l2tp", "l2f", "lkm", "ospf", "pap", "psn", "ppp", "pptp", "perl","c++","c#", "php", "pgp", "pki", "pfs", "arp",
"rarp", "rsa", "rsbac", "rbac", "rpc", "smime", "s/mime", "ssl", "acl", "sso", "soc", "steganography", "subnet", "syn",
"ack", "saml", "snmp", "telnet", "uri", "url", "vpn", "whois", "wep", "wap", "wpa", "wpa2", "x500", "X.500", "gcm", "spoof", "asn",
"blacklist", "whitelist", "ecb", "ccm", "crl", "checksum", "dmz", "dtls", "dmarc", "spf", "dkim", "dn", "egress", 
"ingress", "txt", "csv", "tsv", "doc", "docx", "fips", "honeypot", "webdav", "oauth", "smb", "powershell", "chroot",
"selinux", "ipsec", "kdc", "kek", "mitm", "phish", "rfid", "rng", "rijndael", "scada", "openid", "dmz", "ssm", "sdlc",
"tpm", "vm", "wap", "wlan", "x509", "x.509", "ack", "bgp", "cgi", "chap", "mschap", "ttls", "crc", "dsa", "dss",
"underflow", "duplex", "csrf", "cswsh", "sqli", "sql", "nosql", "iframe", "div", "hyperlink", "xinetd", "systemd", "l2f",
"lkm", "loopback","multicast","multihome","multiplex", "nat", "%00", "octet", "ipv4", "ipv6", "osi", "x400","x.400", "overload",
"polymorphism", "polyinstantiation", "pfs","rfc","skey","s/key", "tcpdump", "wireshark", "jquery", "f5", "redirect",
"aead", "ctr", "ansi", "asic", "apu", "amd", "nvidia", "gpu", "asn", "asn.1", "ext", "ext3", "ext4", "fat32", "macos",
 "bsd", "openbsd", "freebsd", "axfr", "bios", "b2b", "baseline", "u2f", "2fa", "gigabyte", "megabyte", "terabyte", "bruteforce",
"bytewise", "xor", "captcha", "s3", "aws", "gcp", "tld", "homoglyph", "ascii","cdrom","bootrom","bootloader", "cert",
"dacl", "r/o", "dhcp", "cms", "microsoft", "powerpoint", "vbscript", "dll", "dylib", "osx", "eapol", "eap", "ecdsa", 
"ecdhe", "eeprom", "efi", "efs", "zfs", "gsm", "cdma", "ss7", "ext2fs", "ext3fs", "fqdn", "whitespace", "gdi", "bitmap",
"gigaherz", "megaherz", "ghz", "mhz", "gps", "gpg", "gnupg", "gnu", "cdma", "guid", "uuid", "rpc", "golang", "hfs", "apfs",
"rootkit", "bootkit", "hklm", "ntlm", "ntlmv2", "mimikatz", "i2c", "ics", "siemens", "bosch", "idp", "isp", "asn", "caml",
"ocaml", "haskell", "javascript", "ecma", "ecmascript", "ecmav6", "ppt", "pptx", "xls", "xpath", "srng", "wsl", "imsi",
"paas", "iaas", "saas", "irc", "isatap", "iso", "iot", "ios", "javaee", "springboot", "ror", "jsp", "tomcat", "solr", 
"kafka", "nginx", "openssh", "openssl", "libressl", "jit", "jose", "jwe", "jwks", "jtag", "jvm", "scala", "erlang", 
"kdc", "ami", "reiserfs", "ibm", "coldfusion", "citrix", "xfs", "fat16", "usb", "sd", "sdcard", "hfs", "udf", "mysql", 
"postgres", "postgresql", "mariadb", "mongodb", "rds", "elasticsearch", "nss", "squashfs", "exfat", "ntfs", "minix",
"led", "lua", "nmap", "emacs", "vim", ".so", "asm", "x86", "x86-64", "x86_64", "mips", "arm64", "lxc", "samsung", "sandisk",
"seagate", "mta", "mua", "user-agent", "x-frame-options", "x-xss-protection", "hsts", "mbps", "mitma", "mmc", "mms", "sms",
"ms-chap", "ms-chapv2", "msdos", "ms-dos", "mimo", "lifo", "fifo", "dereference", "nas", "nat", "netbios", "nic", "nfs",
"nist", "nsa", "oid", "ole", "ocsp", "oem", "ofb", "otp", "openpgp", "xmpp", "cisco", "huawei", "opm", "osi", "otp", 
"owasp", "dsl", "vlan", "voip", "telephony", "mpls", "appletalk", "applescript", "xerox", "iscsi", "socks4", "socks5", 
"localhost", "zip", "7zip", "pzip", "lzma", "tgz", "tftp", "ampq", "upnp", "ibm", "toshiba", "ssdp", "p2p", "afp", 
"pac", "paravirutalization", "parameterization", "parity", "pdf", "pdf", "piv", "phar", "php6", "nodejs", "jose", 
"expressjs", "plist", "plist", 'pseudorandom', "pub", "pki", "mobi", "scorm", "ptt", "puk", "qemu", "qos", "vmware",
"hyper-v", "r/w", "rc4", "rc5", "rdms", "rdbms", "sqlserver", "redis", "memcached", "hbase", "olap", "malware", 
"adware", "scp", "sctp", "sla", "siem", "soc", "spam", "ssd", "nvme", "firmware", "smm", "tacacs", "tftp", 'uart',
"uefi", "grub", "timestamp", "datetime", "vdi", "virtualbox", "emulator", "lte", "4g", "5g", "3g", "vxlan", "vrrp", "vnic",
"wsdl", "wifi", "wimax", "win2k", "www", "xquery", "xsl", "xslt", "css", "stylesheet", "api", "adobe", "firefox", "esr",
"chromium", "ssi", "ssrf", "ssri", "clickjacking", "ubuntu", "centos", "gentoo", "xxe", "dtd", "gdi", "wsus", "npm", 
"github", "git", "svn", "iphone", "vma", "vga", "hdmi", "dvi", "dma", "qualcomm", "broadcomm", "mmc", "chipset",
"xbox", "playstation", "tomcat", "servlet", "asp", "aspx", "asp.net", "oop", "activedirectory", "pth", "winxp", "xp", "sid",
"krbtgt", "msvcrt", "lsa", "punycode", "utf", "utf7", "utf8", "utf-7", "utf-8", "bitwise", ".jsp", "regex", "redos", "float32",
"float64", "typecast", "typecasting", "printf", "sprintf", "fprintf", "filename", "off-by-one", "0x00", "0xff", "16bit",
"32bit", "64bit", "16-bit", "32-bit", "64-bit", "endian", "dereference", "dereferencing", "ioctl", "ttl", "tcp/ip", "xwindow",
"infoleak", "fingerprint", "pwd", "sidechannel", "hardening","regexp", "debug", "debugging", "debugger", "upload", "coldfusion",
 "netscaler", "lifecycle", "joomla","wordpress","libxml","tiff","jpg","jpeg","svg","gif","fortinet", "esxi", "uaf", "use-after-free",
 "sp1", "sp2","lnk", "samsung", "nokia","motorola", "gnutls","cors","crm","drupal","lfi","rfi", "malloc", "rhel", "sharepoint",
 "uxss","symlink", "hardlink"
]
